Results/Verifications/S2427/bottleneck-determination/read_only/threads-32/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=32 oltp_read_only --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-type=
uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 222.98 qps: 3599.43 (r/w/o: 3150.47/0.00/448.97) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 279.91 qps: 4480.52 (r/w/o: 3920.49/0.00/560.03) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 242.80 qps: 3878.93 (r/w/o: 3393.43/0.00/485.50) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 297.60 qps: 4766.77 (r/w/o: 4171.48/0.00/595.30) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 261.40 qps: 4181.49 (r/w/o: 3658.79/0.00/522.70) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 264.50 qps: 4229.91 (r/w/o: 3700.91/0.00/529.00) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 294.80 qps: 4721.28 (r/w/o: 4131.58/0.00/589.70) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 261.90 qps: 4184.32 (r/w/o: 3660.52/0.00/523.80) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 285.70 qps: 4577.20 (r/w/o: 4005.90/0.00/571.30) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 279.00 qps: 4463.12 (r/w/o: 3905.11/0.00/558.00) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            377146
        write:                           0
        other:                           53878
        total:                           431024
    transactions:                        26939  (269.08 per sec.)
    queries:                             431024 (4305.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.1107s
    total number of events:              26939

Latency (ms):
         min:                                   59.57
         avg:                                  118.84
         max:                                 2208.24
         95th percentile:                      189.93
         sum:                              3201484.99

Threads fairness:
    events (avg/stddev):           841.8438/6.63
    execution time (avg/stddev):   100.0464/0.03


real    1m40.585s
user    0m18.659s
sys     0m20.990s